docs(report): Updating E-R Diagram into Mermaid Syntax
